def inc(a):
    return a+1

def dec(a):
    return a-1

def add1(a, b):
    if a == 0:
        return b
    else :
        return inc(add1(dec(a), b))

def add2(a, b):
    if a == 0:
        return b
    else:
        return add2(dec(a), inc(b))

print(add1(4, 5))
print(add2(4, 5))

# add1 ը ռեկուրսիվ է, որովհետև ֆունկցիայի կանչի ժամանակ ստեղծվում են local environment ներ, 
# ամեն մեկում 1֊ով մեծ արդյունքով, մինչև առաջին արգումենտը հասնի զրոյի։

# Իսկ add2ը պոչավոր ռեկուրսիվ է, որովհետև ֆունկցիայի միջից ֆունկցիան կանչելուց հետո 
# նախորդ environment ը այլևս պետք չէ մեզ, քանի որ արգումենտներից մեկը մեծանում է մեկով, 
# մինչև մյուս արգումենտը հասնի զրոյի, արդյունքում հասնելով երկու արգումենտների գումարին։